## Terraform Plan Results

| Check | Status |
|-------|--------|
| Format | ✅ |
| Validate | ✅ |
| tflint | ✅ |
| Trivy | ✅ |
| Plan | ✅ |
| Docs | ❌ (run `terraform-docs` locally) |

<details>
<summary>Plan Output</summary>

```
module.iam.data.aws_iam_policy_document.ecs_task_execution_assume: Reading...
module.iam.data.aws_caller_identity.current: Reading...
module.iam.data.aws_iam_policy_document.efs_access: Reading...
module.iam.data.aws_iam_policy_document.ecs_task_execution_assume: Read complete after 0s [id=1077804475]
data.aws_route53_zone.main[0]: Reading...
module.iam.data.aws_iam_policy_document.efs_access: Read complete after 0s [id=3403182525]
data.aws_caller_identity.current: Reading...
module.rds.data.aws_region.current: Reading...
module.rds.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.iam.data.aws_caller_identity.current: Read complete after 0s [id=546464732019]
module.iam.data.aws_iam_policy_document.apps_task_policy: Reading...
module.iam.data.aws_iam_policy_document.github_actions_logs: Reading...
module.iam.data.aws_iam_policy_document.github_actions_rds: Reading...
module.iam.data.aws_iam_policy_document.apps_task_policy: Read complete after 0s [id=3560023943]
module.iam.data.aws_iam_policy_document.github_actions_logs: Read complete after 0s [id=742353781]
module.iam.data.aws_iam_policy_document.github_actions_rds: Read complete after 0s [id=1544605704]
module.iam.data.aws_iam_policy_document.ecs_execution_secrets: Reading...
module.iam.data.aws_iam_policy_document.github_actions_secrets: Reading...
module.iam.data.aws_iam_policy_document.ecs_execution_secrets: Read complete after 0s [id=1944465374]
module.iam.data.aws_iam_policy_document.github_actions_secrets: Read complete after 0s [id=1364670224]
data.aws_caller_identity.current: Read complete after 1s [id=546464732019]
module.iam.data.aws_iam_policy_document.github_actions_ecr: Reading...
module.iam.data.aws_iam_policy_document.github_actions_ecr: Read complete after 0s [id=2731502787]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # aws_acm_certificate.main[0] will be created
  + resource "aws_acm_certificate" "main" {
      + arn                       = (known after apply)
      + domain_name               = "staging.michaelbean.org"
      + domain_validation_options = [
          + {
              + domain_name           = "*.staging.michaelbean.org"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "staging.michaelbean.org"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.staging.michaelbean.org",
          + "staging.michaelbean.org",
        ]
      + tags                      = {
          + "Name" = "saleor-platform-staging-cert"
        }
      + tags_all                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-cert"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate.storefront_cdn[0] will be created
  + resource "aws_acm_certificate" "storefront_cdn" {
      + arn                       = (known after apply)
      + domain_name               = "staging.michaelbean.org"
      + domain_validation_options = [
          + {
              + domain_name           = "*.staging.michaelbean.org"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "staging.michaelbean.org"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.staging.michaelbean.org",
          + "staging.michaelbean.org",
        ]
      + tags                      = {
          + "Name"    = "saleor-platform-staging-storefront-cdn-cert"
          + "Service" = "storefront"
        }
      + tags_all                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-storefront-cdn-cert"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
          + "Service"     = "storefront"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_config_config_rule.required_tags[0] will be created
  + resource "aws_config_config_rule" "required_tags" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + tag1Key   = "ManagedBy"
              + tag1Value = "terraform"
            }
        )
      + name             = "saleor-platform-staging-required-tags"
      + rule_id          = (known after apply)
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-required-tags"
          + "Project"     = "saleor-platform"
          + "Purpose"     = "drift-prevention"
          + "Repository"  = "saleor-platform"
          + "Service"     = "aws-config"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-required-tags"
          + "Project"     = "saleor-platform"
          + "Purpose"     = "drift-prevention"
          + "Repository"  = "saleor-platform"
          + "Service"     = "aws-config"
        }

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::NatGateway",
              + "AWS::EC2::SecurityGroup",
              + "AWS::EC2::Subnet",
              + "AWS::EC2::VPC",
              + "AWS::ElasticLoadBalancingV2::LoadBalancer",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "REQUIRED_TAGS"
        }
    }

  # aws_config_configuration_recorder.main[0] will be created
  + resource "aws_config_configuration_recorder" "main" {
      + id       = (known after apply)
      + name     = "saleor-platform-staging-recorder"
      + role_arn = (known after apply)

      + recording_group {
          + all_supported                 = false
          + include_global_resource_types = false
          + resource_types                = [
              + "AWS::EC2::InternetGateway",
              + "AWS::EC2::NatGateway",
              + "AWS::EC2::SecurityGroup",
              + "AWS::EC2::Subnet",
              + "AWS::EC2::VPC",
              + "AWS::ElasticLoadBalancingV2::LoadBalancer",
            ]
        }
    }

  # aws_config_configuration_recorder_status.main[0] will be created
  + resource "aws_config_configuration_recorder_status" "main" {
      + id         = (known after apply)
      + is_enabled = true
      + name       = "saleor-platform-staging-recorder"
    }

  # aws_config_delivery_channel.main[0] will be created
  + resource "aws_config_delivery_channel" "main" {
      + id             = (known after apply)
      + name           = "saleor-platform-staging-delivery"
      + s3_bucket_name = (known after apply)

      + snapshot_delivery_properties {
          + delivery_frequency = "TwentyFour_Hours"
        }
    }

  # aws_iam_role.config[0] will be created
  + resource "aws_iam_role" "config" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "config.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "saleor-platform-staging-config"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-config"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
          + "Service"     = "aws-config"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-config"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
          + "Service"     = "aws-config"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.config_s3[0] will be created
  + resource "aws_iam_role_policy" "config_s3" {
      + id          = (known after apply)
      + name        = "s3-delivery"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.config[0] will be created
  + resource "aws_iam_role_policy_attachment" "config" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWS_ConfigRole"
      + role       = "saleor-platform-staging-config"
    }

  # aws_kms_alias.config_bucket[0] will be created
  + resource "aws_kms_alias" "config_bucket" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/saleor-platform-staging-config-bucket"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.config_bucket[0] will be created
  + resource "aws_kms_key" "config_bucket" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for AWS Config S3 bucket encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-config-bucket-key"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
          + "Service"     = "aws-config"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-config-bucket-key"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
          + "Service"     = "aws-config"
        }
    }

  # aws_s3_bucket.config[0] will be created
  + resource "aws_s3_bucket" "config" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "saleor-platform-staging-config-546464732019"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-config"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
          + "Service"     = "aws-config"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-config"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
          + "Service"     = "aws-config"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_policy.config[0] will be created
  + resource "aws_s3_bucket_policy" "config" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.config[0] will be created
  + resource "aws_s3_bucket_public_access_block" "config" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.config[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "config" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.config[0] will be created
  + resource "aws_s3_bucket_versioning" "config" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_secretsmanager_secret.meilisearch_master_key[0] will be created
  + resource "aws_secretsmanager_secret" "meilisearch_master_key" {
      + arn                            = (known after apply)
      + description                    = "Meilisearch master key for API authentication"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "saleor/staging/meilisearch/master-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Name"    = "saleor-platform-staging-meilisearch-master-key"
          + "Service" = "meilisearch"
        }
      + tags_all                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-meilisearch-master-key"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
          + "Service"     = "meilisearch"
        }
    }

  # aws_secretsmanager_secret_version.meilisearch_master_key_generated[0] will be created
  + resource "aws_secretsmanager_secret_version" "meilisearch_master_key_generated" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # aws_service_discovery_private_dns_namespace.main will be created
  + resource "aws_service_discovery_private_dns_namespace" "main" {
      + arn         = (known after apply)
      + description = "Private DNS namespace for saleor-platform-staging services"
      + hosted_zone = (known after apply)
      + id          = (known after apply)
      + name        = "saleor-platform-staging.local"
      + tags        = {
          + "Environment" = "staging"
          + "Name"        = "saleor-platform-staging.local"
        }
      + tags_all    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging.local"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
        }
      + vpc         = (known after apply)
    }

  # aws_sns_topic.alerts[0] will be created
  + resource "aws_sns_topic" "alerts" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "saleor-platform-staging-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.alert_email[0] will be created
  + resource "aws_sns_topic_subscription" "alert_email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "michael@michaelbean.org"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # random_password.db_master will be created
  + resource "random_password" "db_master" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 32
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # random_password.meilisearch_master_key[0] will be created
  + resource "random_password" "meilisearch_master_key" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.alb.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 120
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "saleor-platform-staging-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name" = "saleor-platform-staging-alb"
        }
      + tags_all                                                     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-alb"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.alb.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.alb.aws_lb_listener.https[0] will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags_all                                                              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_listener_rule.api[0] will be created
  + resource "aws_lb_listener_rule" "api" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags_all     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "api.staging.michaelbean.org",
                ]
            }
        }
    }

  # module.alb.aws_lb_listener_rule.dashboard[0] will be created
  + resource "aws_lb_listener_rule" "dashboard" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 110
      + tags_all     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "dashboard.staging.michaelbean.org",
                ]
            }
        }
    }

  # module.alb.aws_lb_listener_rule.inventory_ops_app[0] will be created
  + resource "aws_lb_listener_rule" "inventory_ops_app" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 210
      + tags_all     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "apps.staging.michaelbean.org",
                ]
            }
        }
      + condition {
          + path_pattern {
              + values = [
                  + "/apps/inventory",
                  + "/apps/inventory/*",
                ]
            }
        }
    }

  # module.alb.aws_lb_listener_rule.pos_app[0] will be created
  + resource "aws_lb_listener_rule" "pos_app" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 230
      + tags_all     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "apps.staging.michaelbean.org",
                ]
            }
        }
      + condition {
          + path_pattern {
              + values = [
                  + "/apps/pos",
                  + "/apps/pos/*",
                ]
            }
        }
    }

  # module.alb.aws_lb_listener_rule.storefront[0] will be created
  + resource "aws_lb_listener_rule" "storefront" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 300
      + tags_all     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "staging.michaelbean.org",
                  + "www.staging.michaelbean.org",
                ]
            }
        }
    }

  # module.alb.aws_lb_listener_rule.stripe_app[0] will be created
  + resource "aws_lb_listener_rule" "stripe_app" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 200
      + tags_all     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "apps.staging.michaelbean.org",
                ]
            }
        }
      + condition {
          + path_pattern {
              + values = [
                  + "/apps/stripe",
                  + "/apps/stripe/*",
                ]
            }
        }
    }

  # module.alb.aws_lb_target_group.api will be created
  + resource "aws_lb_target_group" "api" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "saleor-platform-staging-api"
      + name_prefix                        = (known after apply)
      + port                               = 8000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "saleor-platform-staging-api"
          + "Service" = "api"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-api"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
          + "Service"     = "api"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/health/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.alb.aws_lb_target_group.dashboard will be created
  + resource "aws_lb_target_group" "dashboard" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "sp-staging-dashboard"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "saleor-platform-staging-dashboard"
          + "Service" = "dashboard"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-dashboard"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
          + "Service"     = "dashboard"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.alb.aws_lb_target_group.inventory_ops_app will be created
  + resource "aws_lb_target_group" "inventory_ops_app" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "saleor-platform-staging-inv-ops"
      + name_prefix                        = (known after apply)
      + port                               = 3002
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "saleor-platform-staging-inventory-ops-app"
          + "Service" = "inventory-ops-app"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-inventory-ops-app"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
          + "Service"     = "inventory-ops-app"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/apps/inventory/api/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.alb.aws_lb_target_group.pos_app will be created
  + resource "aws_lb_target_group" "pos_app" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "saleor-platform-staging-pos"
      + name_prefix                        = (known after apply)
      + port                               = 3004
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "saleor-platform-staging-pos-app"
          + "Service" = "pos-app"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-pos-app"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
          + "Service"     = "pos-app"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/apps/pos/api/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.alb.aws_lb_target_group.storefront will be created
  + resource "aws_lb_target_group" "storefront" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "sp-staging-storefront"
      + name_prefix                        = (known after apply)
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "saleor-platform-staging-storefront"
          + "Service" = "storefront"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-storefront"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
          + "Service"     = "storefront"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/api/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.alb.aws_lb_target_group.stripe_app will be created
  + resource "aws_lb_target_group" "stripe_app" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "saleor-platform-staging-stripe"
      + name_prefix                        = (known after apply)
      + port                               = 3001
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "saleor-platform-staging-stripe-app"
          + "Service" = "stripe-app"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "saleor-platform-staging-stripe-app"
          + "Project"     = "saleor-platform"
          + "Repository"  = "saleor-platform"
          + "Service"     = "stripe-app"
        }
      + target_type                        = "ip"
      + vpc_id                     

... (truncated)
```

</details>

---
*Generated by terraform-plan-on-pr workflow*